#Область ТестовыеКоманды

&НаКлиенте
Процедура ТестоваяПечать(Команда)
	
	ОбъектыНазначения = Новый Массив;
	Для каждого ТекЭлементСписка Из МассивОбъектов Цикл
		ОбъектыНазначения.Добавить(ТекЭлементСписка.Значение);
	КонецЦикла; 
	
	Печать("ПФ_MXL_УведомлениеОбУвольнении_14_XLS",ОбъектыНазначения);

КонецПроцедуры

#КонецОбласти

#Область Печать

&НаКлиенте
Процедура Печать(ИдентификаторКоманды, ОбъектыНазначения)  Экспорт 
	
	АдресВоВременномХранилище = ПолучитьДанныеПечати(ОбъектыНазначения);
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	//Инициализация Excel
	Попытка	
		ОбъектCOM = Новый COMОбъект("Excel.Application");
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xls");
		СтруктураДанных.МакетУведомление.Записать(ИмяВременногоФайла); //Двоичные данные
		
		ПечатнаяФорма = ОбъектCOM.WorkBooks.Open(ИмяВременногоФайла);
		ПечатнаяФорма.Application.DisplayAlerts = Ложь;
		ПечатнаяФорма.Activate();
		
		
	Исключение
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Возникла проблема с созданием файла Excel";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецПопытки;
	
	//Инициализация Word
	Попытка	
		ОбъектWORD = Новый COMОбъект("Word.Application");
	Исключение
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Возникла проблема с созданием файла Word";
		СообщениеПользователю.Сообщить();
		ОбъектWORD = Неопределено;
		Возврат;
	КонецПопытки;

	
	//Добавление пустых листов в книгу по 2 на каждое ФизЛицо
	ПервыйВход = Истина;
	Для каждого КлючИЗначение Из СтруктураДанных.СоответствиеДанныеОбъектов Цикл
		ДобавитьСтраницыВКнигу(ПечатнаяФорма,ПервыйВход,КлючИЗначение.Значение.Фамилия)
	КонецЦикла; 
	
	НетДанных = Истина;
	//Заполнение шаблонов
	Для каждого КлючИЗначение Из  СтруктураДанных.СоответствиеДанныеОбъектов Цикл
		
		//Excel
		Попытка
			ЗаполнениеШаблона(КлючИЗначение.Значение,СтруктураДанных.ДанныеИнспектораПоКадрам,ПечатнаяФорма);
			ПечатнаяФорма.Save();	
			НетДанных = Ложь;
			
		Исключение
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = ОписаниеОшибки();
			СообщениеПользователю.Сообщить();
			ОбъектCOM.Quit();
			ОбъектCOM = Неопределено;
			
		КонецПопытки;
		
		//Word
		
		Попытка
			ИмяВременногоФайла_Word = ПолучитьИмяВременногоФайла(".dotx");
			СтруктураДанных.Справка.Записать(ИмяВременногоФайла_Word); 
			ПечатнаяФормаWord = ОбъектWORD.Documents.Open(ИмяВременногоФайла_Word);
			ПечатнаяФормаWord.Activate();

			//
			ЗаполнениеШаблонаWord(КлючИЗначение.Значение,СтруктураДанных.ДанныеИнспектораПоКадрам,ПечатнаяФормаWord);
			
			ПечатнаяФормаWord.Save();	
			
			
		Исключение
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = ОписаниеОшибки();
			СообщениеПользователю.Сообщить();
			ОбъектWORD.Quit();
			ОбъектWORD = Неопределено;
		КонецПопытки;

	КонецЦикла; 

	Если НетДанных Тогда
		ОбъектCOM.Quit();
		ОбъектCOM = Неопределено;
	Иначе
		ОбъектCOM.Visible  = Истина;
		ОбъектCOM 		   = Неопределено;
	КонецЕсли; 
	
	Если Не ОбъектWORD 	= Неопределено Тогда
		ОбъектWORD.Visible  = Истина;
		ОбъектWORD 			= Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеШаблона(ДанныеОбъекта,ДанныеИнспектора,ПечатнаяФорма)

	ЛистОсновной 		= ПечатнаяФорма.WorkSheets(ИмяОсновногоЛиста(ДанныеОбъекта.Фамилия));
	ЛистДополнительнй 	= ПечатнаяФорма.WorkSheets(ИмяДополнительногоЛиста(ДанныеОбъекта.Фамилия));
	
	СтруктураБлоковДопЛиста =  СтруктураДополнительногоЛиста();
	
#Область ОсновнойЛист
	
#Область КонтактныйТелефон

	//++1. Контактный телефон
	ТекстВвода 		 	= ДанныеИнспектора.НомерТелефона;
	МассивКолонок = МассивКолонокВвода(28);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); //где 100 № последней ячейки

	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(63, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--1. Контактный телефон
	
#КонецОбласти 

#Область ФИО_Гражданство

	//++2.1 Фамилия 
	ТекстВвода 		 = ВРЕГ(ДанныеОбъекта.Фамилия);
	МассивКолонок = МассивКолонокВвода(19);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); //где 100 № последней ячейки

	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(67, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.1 Фамилия 

	//++2.2 Имя 
	ТекстВвода 		 = ВРЕГ(ДанныеОбъекта.Имя);
	НачальнаяКолонка = 2;
	МассивКолонок = МассивКолонокВвода(19);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); //где 100 № последней ячейки

	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(69, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.2 Имя 

	//++2.3 Отчество 
	ТекстВвода 		 = ВРЕГ(ДанныеОбъекта.Отчество);
	НачальнаяКолонка = 2;
	МассивКолонок = МассивКолонокВвода(19);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); //где 100 № последней ячейки

	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(72, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.3 Отчество 
	
	//++2.4 Гражданство 
	ТекстВвода 		 = ВРЕГ(ДанныеОбъекта.Гражданство);
	МассивКолонок = МассивКолонокВвода(22);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); //где 100 № последней ячейки
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(75, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.4 Гражданство 
	
#КонецОбласти 

#Область МестоРождения
	
	//++2.5 Место рождения 
	ТекстВвода 		 = СокрЛП(СтрЗаменить(Сред(ВРЕГ(ДанныеОбъекта.МестоРождения),3),","," "));
	МассивКолонок1 = МассивКолонокВвода(40,97);
	МассивКолонок2 = МассивКолонокВвода(1);
	МассивКолонок3 = МассивКолонокВвода(1);
		
	//1-я строка
	ВывестиОстатокТекстаВСтроку(ТекстВвода,78,МассивКолонок1,1,ЛистОсновной);
	//2-я строка
	ВывестиОстатокТекстаВСтроку(ТекстВвода,81,МассивКолонок2,МассивКолонок1.Количество()+1,ЛистОсновной);
	//3-я строка
	ВывестиОстатокТекстаВСтроку(ТекстВвода,83,МассивКолонок3,МассивКолонок2.Количество()+1,ЛистОсновной);
	//--2.5 Место рождения 
	
#КонецОбласти 

#Область ДатаРождения
	
	//++2.6 Дата рождения 
	СтруктураДаты = ПреобразоватьДатуВСтруктуруВвода(ДанныеОбъекта.ДатаРождения);
	
	ТекстВвода 		 = СтруктураДаты.День;
	МассивКолонок = МассивКолонокВвода(25,28);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(86, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
	ТекстВвода 		 = СтруктураДаты.Месяц;
	МассивКолонок = МассивКолонокВвода(33,36);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(86, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 

	ТекстВвода 		 = СтруктураДаты.Год;
	МассивКолонок = МассивКолонокВвода(41,50);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(86, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.6 Дата рождения
#КонецОбласти 	

#Область Паспорт

	//2.7.1 Данные паспорта  Серия
	ТекстВвода 		 = ДанныеОбъекта.Серия;
	МассивКолонок = МассивКолонокВвода(10,28);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(92, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
	//2.7.2 Данные паспорта  Номер
	ТекстВвода 		 = ДанныеОбъекта.Номер;
	МассивКолонок = МассивКолонокВвода(41,68);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(92, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
#КонецОбласти 

#Область ДатаВыдачиПаспорта
	
	//++2.7.3 Данные паспорта  Дата выдачи
	СтруктураДаты = ПреобразоватьДатуВСтруктуруВвода(ДанныеОбъекта.ДатаВыдачи);

	ТекстВвода 		 = СтруктураДаты.День;
	МассивКолонок = МассивКолонокВвода(19,22);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(94, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
	ТекстВвода 		 = СтруктураДаты.Месяц;
	МассивКолонок = МассивКолонокВвода(27,30);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(94, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 

	ТекстВвода 		 = СтруктураДаты.Год;
	МассивКолонок = МассивКолонокВвода(35,44);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(94, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.7.3 Данные паспорта  Дата выдачи
	
#КонецОбласти

#Область КемВыданПаспорт

	//2.7 КемВыдан 
	ТекстВвода 		 = СокрЛП(ВРег(ДанныеОбъекта.КемВыдан));
	МассивКолонок1 = МассивКолонокВвода(16);
	МассивКолонок2 = МассивКолонокВвода(1);
	
	//1-я строка
	ВывестиОстатокТекстаВСтроку(ТекстВвода,97,МассивКолонок1,1,ЛистОсновной);
	//2-я строка
	ВывестиОстатокТекстаВСтроку(ТекстВвода,99,МассивКолонок2,МассивКолонок1.Количество()+1,ЛистОсновной);
	
#КонецОбласти 

#Область МиграционнаяКарта
	//2.8 Номер миграционной карты карты 
	ТекстВвода 		 = ВРег(СтрШаблон("%1 %2",ДанныеОбъекта.МиграционнаяКартаСерия,ДанныеОбъекта.МиграционнаяКартаНомер));
	ПроверкаНаПробелыНули(ТекстВвода); 

	МассивКолонок = МассивКолонокВвода(43,100);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(101, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
#КонецОбласти 

#Область ДатаВыдачиКарты
	
	//++ Дата карты
	СтруктураДаты = ПреобразоватьДатуВСтруктуруВвода(ДанныеОбъекта.МиграционнаяКартаДатаВыдачи);

	ТекстВвода 		 = СтруктураДаты.День;
	МассивКолонок = МассивКолонокВвода(24,27);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(104, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
	ТекстВвода 		 = СтруктураДаты.Месяц;
	МассивКолонок = МассивКолонокВвода(32,35);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(104, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 

	ТекстВвода 		 = СтруктураДаты.Год;
	МассивКолонок = МассивКолонокВвода(40,49);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(104, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
//-- Дата карты
	
#КонецОбласти 

#Область АдресУчета
	
//2.9 Адрес учета
	ТекстВвода 		 = СтрЗаменить(ВРег(ДанныеОбъекта.ДомашнийАдрес),"РОССИЯ","");
	ТекстВвода = СокрЛП(СтрЗаменить(ТекстВвода,",",""));
	ПроверкаНаПробелыНули(ТекстВвода); 

	МассивКолонок1 = МассивКолонокВвода(61);
	МассивКолонок2 = МассивКолонокВвода(1);
	МассивКолонок3 = МассивКолонокВвода(1);
	
	КоличествоЯчеекОЛ = МассивКолонок1.Количество() + МассивКолонок2.Количество() + МассивКолонок3.Количество();
	Если СтрДлина(ТекстВвода) > КоличествоЯчеекОЛ Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяОбласти","2.9");
		СтруктураПараметров.Вставить("Описание",	" Адрес постановки на учет по месту пребывания или адрес регистрации по месту жительства (при наличии)");
		СтруктураПараметров.Вставить("СтруктураБлоковДопЛиста",	СтруктураБлоковДопЛиста);
		СтруктураПараметров.Вставить("ЛистДополнительнй",		ЛистДополнительнй);
	
		ВвестиДанныеВДополнительныйЛист(ТекстВвода,КоличествоЯчеекОЛ,СтруктураПараметров);
	
	КонецЕсли;
	//если строка больше, то мы её уже порезали и теперь выводим остаток
	
	//1-я строка
	ВывестиОстатокТекстаВСтроку(ТекстВвода,107,МассивКолонок1,1,ЛистОсновной);
	//2-я строка
	ВывестиОстатокТекстаВСтроку(ТекстВвода,109,МассивКолонок2,МассивКолонок1.Количество()+1,ЛистОсновной);
	//3-я строка
	ВывестиОстатокТекстаВСтроку(ТекстВвода,111,МассивКолонок3,МассивКолонок2.Количество()+1,ЛистОсновной);
	
	
#КонецОбласти 

#Область ДатаРегистрации
	
	//++ Дата регистрации 
	//СтруктураДаты = ПреобразоватьДатуВСтруктуруВвода(ДанныеОбъекта.ДатаРегистрации);

	//ТекстВвода 		 = СтруктураДаты.День;
	//МассивКолонок = МассивКолонокВвода(24,27);
	//МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	//Для Индекс = 0 По МаксимальныйИндекс Цикл
	//	ЛистОсновной.Cells(115, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	//КонецЦикла; 
	//
	//ТекстВвода 		 = СтруктураДаты.Месяц;
	//МассивКолонок = МассивКолонокВвода(32,35);
	//МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	//Для Индекс = 0 По МаксимальныйИндекс Цикл
	//	ЛистОсновной.Cells(115, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	//КонецЦикла; 

	//ТекстВвода 		 = СтруктураДаты.Год;
	//МассивКолонок = МассивКолонокВвода(40,49);
	//МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	//Для Индекс = 0 По МаксимальныйИндекс Цикл
	//	ЛистОсновной.Cells(115, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	//КонецЦикла; 
	
#КонецОбласти 

#Область Патент

	//3.1 Серия патента 
	ТекстВвода 		 = ДанныеОбъекта.ПатентСерия;
	МассивКолонок = МассивКолонокВвода(16,49);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(123, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 

	// Номер патента 
	ТекстВвода 		 = ДанныеОбъекта.ПатентНомер;
	МассивКолонок = МассивКолонокВвода(58,94);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(123, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
#КонецОбласти 
	
#Область ДатаПатента
	
	//++ Дата  
	СтруктураДаты = ПреобразоватьДатуВСтруктуруВвода(ДанныеОбъекта.ПатентДатаВыдачи);

	ТекстВвода 		 = СтруктураДаты.День;
	МассивКолонок = МассивКолонокВвода(19,22);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(125, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
	ТекстВвода 		 = СтруктураДаты.Месяц;
	МассивКолонок = МассивКолонокВвода(27,30);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(125, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 

	ТекстВвода 		 = СтруктураДаты.Год;
	МассивКолонок = МассивКолонокВвода(35,44);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(125, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
#КонецОбласти 	

#Область СрокДействияПатента
	
	//++ Дата регистрации 
	СтруктураДаты = ПреобразоватьДатуВСтруктуруВвода(ДанныеОбъекта.ПатентСрокС);

	ТекстВвода 		 = СтруктураДаты.День;
	МассивКолонок = МассивКолонокВвода(25,28);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(132, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
	ТекстВвода 		 = СтруктураДаты.Месяц;
	МассивКолонок = МассивКолонокВвода(33,36);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(132, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 

	ТекстВвода 		 = СтруктураДаты.Год;
	МассивКолонок = МассивКолонокВвода(41,50);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(132, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
#КонецОбласти

#Область Профессия
 	
//3.2 Профессия 
	ТекстВвода 		 = ВРег(ДанныеОбъекта.Должность);
	МассивКолонок = МассивКолонокВвода(1);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(149, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
#КонецОбласти

#Область ДатаРасторженияДоговора
	
	//++ Дата регистрации 
	СтруктураДаты = ПреобразоватьДатуВСтруктуруВвода(ДанныеОбъекта.ДатаУвольнения);

	ТекстВвода 		 = СтруктураДаты.День;
	МассивКолонок = МассивКолонокВвода(73,76);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(161, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
	ТекстВвода 		 = СтруктураДаты.Месяц;
	МассивКолонок = МассивКолонокВвода(82,85);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(161, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 

	ТекстВвода 		 = СтруктураДаты.Год;
	МассивКолонок = МассивКолонокВвода(91,100);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); 
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистОсновной.Cells(161, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	
#КонецОбласти

#Область ПодвалОсновногоЛиста
	ФИОИнспектора =  СтрШаблон("%1 %2.%3.",
				ДанныеИнспектора.Фамилия,
				Лев(ДанныеИнспектора.Имя,1),
				Лев(ДанныеИнспектора.Отчество,1)); 
				
	ЛистОсновной.Cells(173, 1).Value = ДанныеИнспектора.Должность;
	ЛистОсновной.Cells(173, 56).Value = ФИОИнспектора;
	
	ДатаФормирования = ТекущаяДата();
	ЛистОсновной.Cells(178, 3).Value = Формат(ДатаФормирования,"ДФ=""дд""");
	ЛистОсновной.Cells(178, 9).Value = МесяцПрописью(ДатаФормирования);
	ЛистОсновной.Cells(178, 29).Value = Формат(ДатаФормирования,"ДФ=""гггг""");
	
	//Доверенность
	ЛистОсновной.Cells(181, 48).Value = ДанныеИнспектора.ДоверенностьНомер;
	ЛистОсновной.Cells(181, 61).Value = Формат(ДанныеИнспектора.ДоверенностьДата,"ДФ=""дд""");
	ЛистОсновной.Cells(181, 67).Value = МесяцПрописью(ДанныеИнспектора.ДоверенностьДата);
	ЛистОсновной.Cells(181, 85).Value = Формат(ДанныеИнспектора.ДоверенностьДата,"ДФ=""гггг""");

	//ФИО
	ЛистОсновной.Cells(185, 44).Value = СтрШаблон("%1 %2 %3",ДанныеИнспектора.Фамилия,ДанныеИнспектора.Имя,ДанныеИнспектора.Отчество);
	
	//Паспорт
	ЛистОсновной.Cells(187, 10).Value = ДанныеИнспектора.Серия;
	ЛистОсновной.Cells(187, 32).Value = ДанныеИнспектора.Номер;
	ЛистОсновной.Cells(189, 15).Value = ДанныеИнспектора.КемВыдан;
	
	ЛистОсновной.Cells(187, 59).Value = Формат(ДанныеИнспектора.ДатаВыдачи,"ДФ=""дд""");
	ЛистОсновной.Cells(187, 66).Value = МесяцПрописью(ДанныеИнспектора.ДатаВыдачи);
	ЛистОсновной.Cells(187, 89).Value = Формат(ДанныеИнспектора.ДатаВыдачи,"ДФ=""гггг""");
	
#КонецОбласти 

#КонецОбласти 

#Область ДополнительныйЛист

#Область ФИО

	//++2.1 Фамилия 
	ТекстВвода 		 = ВРЕГ(ДанныеОбъекта.Фамилия);
	МассивКолонок = МассивКолонокВвода(16,97);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница());  

	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистДополнительнй.Cells(21, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.1 Фамилия 

	//++2.2 Имя 
	ТекстВвода 		 = ВРЕГ(ДанныеОбъекта.Имя);
	НачальнаяКолонка = 2;
	МассивКолонок = МассивКолонокВвода(16,97);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); //где 100 № последней ячейки

	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистДополнительнй.Cells(23, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.2 Имя 

	//++2.3 Отчество 
	ТекстВвода 		 = ВРЕГ(ДанныеОбъекта.Отчество);
	НачальнаяКолонка = 2;
	МассивКолонок = МассивКолонокВвода(37,97);
	МаксимальныйИндекс = Мин(СтрДлина(ТекстВвода)-1, МассивКолонок.ВГраница()); //где 100 № последней ячейки

	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ЛистДополнительнй.Cells(25, МассивКолонок[Индекс]).Value = Сред(ТекстВвода, Индекс +1, 1)
	КонецЦикла; 
	//--2.3 Отчество 
		
#КонецОбласти 

#Область Подвал 
	ФИОИнспектора =  СтрШаблон("%1 %2.%3.",
				ДанныеИнспектора.Фамилия,
				Лев(ДанныеИнспектора.Имя,1),
				Лев(ДанныеИнспектора.Отчество,1)); 
				
	ЛистДополнительнй.Cells(84, 1).Value = ДанныеИнспектора.Должность;
	ЛистДополнительнй.Cells(84, 54).Value = ФИОИнспектора;
	
	ДатаФормирования = ТекущаяДата();
	ЛистДополнительнй.Cells(86, 3).Value = Формат(ДатаФормирования,"ДФ=""дд""");
	ЛистДополнительнй.Cells(86, 9).Value = МесяцПрописью(ДатаФормирования);
	ЛистДополнительнй.Cells(86, 29).Value = Формат(ДатаФормирования,"ДФ=""гггг""");
	
	//Доверенность
	ЛистДополнительнй.Cells(88, 47).Value = ДанныеИнспектора.ДоверенностьНомер;
			
	ЛистДополнительнй.Cells(88, 58).Value = Формат(ДанныеИнспектора.ДоверенностьДата,"ДФ=""дд""");
	ЛистДополнительнй.Cells(88, 63).Value = МесяцПрописью(ДанныеИнспектора.ДоверенностьДата);
	ЛистДополнительнй.Cells(88, 73).Value = Формат(ДанныеИнспектора.ДоверенностьДата,"ДФ=""гггг""");

	//ФИО
	ЛистДополнительнй.Cells(90, 44).Value = СтрШаблон("%1 %2 %3",ДанныеИнспектора.Фамилия,ДанныеИнспектора.Имя,ДанныеИнспектора.Отчество);
	
	//Паспорт
	ЛистДополнительнй.Cells(91, 9).Value = ДанныеИнспектора.Серия;
	ЛистДополнительнй.Cells(91, 31).Value = ДанныеИнспектора.Номер;
	
	ЛистДополнительнй.Cells(92, 15).Value = ДанныеИнспектора.КемВыдан;
	
	ЛистДополнительнй.Cells(91, 56).Value = Формат(ДанныеИнспектора.ДатаВыдачи,"ДФ=""дд""");
	ЛистДополнительнй.Cells(91, 62).Value = МесяцПрописью(ДанныеИнспектора.ДатаВыдачи);
	ЛистДополнительнй.Cells(91, 83).Value = Формат(ДанныеИнспектора.ДатаВыдачи,"ДФ=""гггг""");
	
#КонецОбласти 

#КонецОбласти 


КонецПроцедуры // ЗаполнениеШаблонаWord()

&НаКлиенте
Процедура ЗаполнениеШаблонаWord(ДанныеОбъекта,ДанныеИнспектора,ПечатнаяФормаWord)

	ТекстВставки = СтрШаблон("ГР. %1, %2 %3 %4, %5 Г.Р., УВОЛЬНЕНИЕ ОТ %6",
									СтрЗаменить(НРег(ДанныеОбъекта.Гражданство),"республика","республики"),
									ДанныеОбъекта.Фамилия,
									ДанныеОбъекта.Имя,
									ДанныеОбъекта.Отчество,
									Формат(ДанныеОбъекта.ДатаРождения,"ДЛФ=Д"),
									Формат(ДанныеОбъекта.ДатаУвольнения,"ДЛФ=Д"));
							
									
	 //Замена параметров
	Замена = ПечатнаяФормаWord.Content.Find;
	Замена.Execute("ТЕКСТУВОЛЬНЕНИЯПРИЕМА", Ложь, Истина, Ложь, , , Истина, , Ложь, ТекстВставки, 2);


//	ГР. РЕСПУБЛИКИ ТАДЖИКИСТАН, АЗИМОВ МУХРИДДИН АЗАМОВИЧ, 10.12.1996 Г.Р., ПРИЕМ ОТ 13.05.2019. 

//ГР. РЕСПУБЛИКИ ТАДЖИКИСТАН, АЗИМОВ МУХРИДДИН АЗАМОВИЧ, 10.12.1996 Г.Р., УВОЛЬНЕНИЕ ОТ 13.05.2019. 

КонецПроцедуры // ЗаполнениеШаблонаWord(КлючИЗначение.Значение,СтруктураДанных.ДанныеИнспектораПоКадрам,ПечатнаяФормаWord)

#КонецОбласти 

#Область ПолучениеДанных

// <Описание функции>
//
&НаСервере
Функция ПолучитьДанныеПечати(МассивДокументов) 

	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина)
	КонецЕсли; 
	
	Результат = ПолучитьДанныеДокументов(МассивДокументов);
		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	
	СоответствиеДанныеОбъектов = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураВозврата = Новый Структура;	
		Для каждого Колонка Из Результат.Колонки Цикл
			СтруктураВозврата.Вставить(Колонка.Имя)
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,ВыборкаДетальныеЗаписи);
		
		СоответствиеДанныеОбъектов.Вставить(ВыборкаДетальныеЗаписи.ФизическоеЛицо,СтруктураВозврата);
		
	
	КонецЦикла; 

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СоответствиеДанныеОбъектов",	СоответствиеДанныеОбъектов);
	СтруктураВозврата.Вставить("МакетУведомление",				ОбработкаОбъект.ПолучитьМакет("МакетУведомление"));
	СтруктураВозврата.Вставить("Справка",						ОбработкаОбъект.ПолучитьМакет("Справка"));
	СтруктураВозврата.Вставить("ДанныеИнспектораПоКадрам",		ДанныеИнспектораПоКадрам());
					
	Возврат ПоместитьВоВременноеХранилище(СтруктураВозврата);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеДокументов(МассивДокументов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов",МассивДокументов);

	Запрос.Текст = "ВЫБРАТЬ
	|	Увольнение.Ссылка КАК Ссылка,
	|	Увольнение.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Увольнение.ДатаУвольнения КАК ДатаУвольнения,
	|	Увольнение.Сотрудник КАК Сотрудник,
	|	Увольнение.Организация КАК Организация,
	|	0 КАК НомерСтроки
	|ПОМЕСТИТЬ ДанныеДокументовУвольнение
	|ИЗ
	|	Документ.Увольнение КАК Увольнение
	|ГДЕ
	|	Увольнение.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УвольнениеСписком.Ссылка,
	|	УвольнениеСпискомСотрудники.ФизическоеЛицо,
	|	УвольнениеСпискомСотрудники.ДатаУвольнения,
	|	УвольнениеСпискомСотрудники.Сотрудник,
	|	УвольнениеСписком.Организация,
	|	УвольнениеСпискомСотрудники.НомерСтроки
	|ИЗ
	|	Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСпискомСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком КАК УвольнениеСписком
	|		ПО УвольнениеСпискомСотрудники.Ссылка = УвольнениеСписком.Ссылка
	|ГДЕ
	|	УвольнениеСпискомСотрудники.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ПРЕДСТАВЛЕНИЕ(КадроваяИсторияСотрудниковСрезПоследних.Должность) КАК Должность
	|ПОМЕСТИТЬ ВременнаяТаблицаДолжностиСотрудников
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
	|			,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					ДанныеДокументовУвольнение.Сотрудник
	|				ИЗ
	|					ДанныеДокументовУвольнение КАК ДанныеДокументовУвольнение)) КАК КадроваяИсторияСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГражданствоФизическихЛицСрезПоследних.Страна КАК Страна,
	|	ГражданствоФизическихЛицСрезПоследних.ИНН КАК ИНН,
	|	СтраныМира.НаименованиеПолное КАК НаименованиеПолноеСтрана
	|ПОМЕСТИТЬ ВременнаяТаблицаГражданство
	|ИЗ
	|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних КАК ГражданствоФизическихЛицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО ГражданствоФизическихЛицСрезПоследних.Страна = СтраныМира.Ссылка
	|ГДЕ
	|	ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ДанныеДокументовУвольнение.ФизическоеЛицо
	|			ИЗ
	|				ДанныеДокументовУвольнение КАК ДанныеДокументовУвольнение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИностранца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеИностранца.РазрешениеСерия КАК РазрешениеСерия,
	|	ДанныеИностранца.РазрешениеНомер КАК РазрешениеНомер,
	|	ДанныеИностранца.РазрешениеДатаВыдачи КАК РазрешениеДатаВыдачи,
	|	ДанныеИностранца.РазрешениеДействительноДо КАК РазрешениеДействительноДо,
	|	ДанныеИностранца.РазрешениеТерриторияДействия КАК РазрешениеТерриторияДействия,
	|	ДанныеИностранца.РазрешениеКемВыдано КАК РазрешениеКемВыдано,
	|	ДанныеИностранца.РазрешениеДатаПостановкиНаМиграционныйУчет КАК РазрешениеДатаПостановкиНаМиграционныйУчет,
	|	ДанныеИностранца.РазрешениеКтоПоставилНаУчет КАК РазрешениеКтоПоставилНаУчет,
	|	ДанныеИностранца.МиграционнаяКартаСерия КАК МиграционнаяКартаСерия,
	|	ДанныеИностранца.МиграционнаяКартаНомер КАК МиграционнаяКартаНомер,
	|	ДанныеИностранца.МиграционнаяКартаДатаВыдачи КАК МиграционнаяКартаДатаВыдачи,
	|	ДанныеИностранца.ПатентСерия КАК ПатентСерия,
	|	ДанныеИностранца.ПатентНомер КАК ПатентНомер,
	|	ДанныеИностранца.ПатентДатаВыдачи КАК ПатентДатаВыдачи,
	|	ДанныеИностранца.ПатентСрокС КАК ПатентСрокС,
	|	ДанныеИностранца.ПатентСрокПо КАК ПатентСрокПо,
	|	ДанныеИностранца.ПатентНаименование КАК ПатентНаименование,
	|	ДанныеИностранца.ПатентКемВыдан КАК ПатентКемВыдан
	|ПОМЕСТИТЬ ВременнаяТаблицаРазрешенияПатенты
	|ИЗ
	|	РегистрСведений.Монолит_ДанныеИностранца КАК ДанныеИностранца
	|ГДЕ
	|	ДанныеИностранца.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ДанныеДокументовУвольнение.ФизическоеЛицо
	|			ИЗ
	|				ДанныеДокументовУвольнение КАК ДанныеДокументовУвольнение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Монолит_УведомленияИностранцев.ПриказОрганизации КАК ПриказОрганизации,
	|	Монолит_УведомленияИностранцев.ГосударственнаяОрганизация КАК ГосударственнаяОрганизация,
	|	Монолит_УведомленияИностранцев.ДатаУведомления КАК ДатаУведомления
	|ПОМЕСТИТЬ ВременнаяТаблицаУведомления
	|ИЗ
	|	РегистрСведений.Монолит_УведомленияИностранцев КАК Монолит_УведомленияИностранцев
	|ГДЕ
	|	Монолит_УведомленияИностранцев.ПриказОрганизации В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛица.МестоРождения КАК МестоРождения,
	|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
	|	ФизическиеЛица.Пол КАК Пол,
	|	ФизическиеЛица.ДатаРегистрации КАК ДатаРегистрации,
	|	ФизическиеЛица.ФИО КАК ФИО,
	|	ФизическиеЛица.Фамилия КАК Фамилия,
	|	ФизическиеЛица.Отчество КАК Отчество,
	|	ФизическиеЛица.Имя КАК Имя
	|ПОМЕСТИТЬ ВременнаяТаблицаДанныеФизическогоЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеДокументовУвольнение.ФизическоеЛицо
	|			ИЗ
	|				ДанныеДокументовУвольнение КАК ДанныеДокументовУвольнение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
	|	ПРЕДСТАВЛЕНИЕ(ДокументыФизическихЛицСрезПоследних.ВидДокумента) КАК ВидДокумента,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
	|	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения
	|ПОМЕСТИТЬ ВременнаяТаблицаДокументыФизичесткогоЛица
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|ГДЕ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо В
	|			(ВЫБРАТЬ
	|				ДанныеДокументовУвольнение.ФизическоеЛицо
	|			ИЗ
	|				ДанныеДокументовУвольнение КАК ДанныеДокументовУвольнение)
	|	И ДокументыФизическихЛицСрезПоследних.ЯвляетсяДокументомУдостоверяющимЛичность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК ДомашнийАдрес
	|ПОМЕСТИТЬ ВременнаяТаблицаАдресФизЛица
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеДокументовУвольнение.ФизическоеЛицо КАК ФизическоеЛицо
	|			ИЗ
	|				ДанныеДокументовУвольнение КАК ДанныеДокументовУвольнение)
	|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументовУвольнение.Ссылка КАК Ссылка,
	|	ДанныеДокументовУвольнение.Организация КАК Организация,
	|	ДанныеДокументовУвольнение.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокументовУвольнение.ДатаУвольнения КАК ДатаУвольнения,
	|	ВременнаяТаблицаДанныеФизическогоЛица.Фамилия КАК Фамилия,
	|	ВременнаяТаблицаДанныеФизическогоЛица.Имя КАК Имя,
	|	ВременнаяТаблицаДанныеФизическогоЛица.Отчество КАК Отчество,
	|	ВременнаяТаблицаГражданство.Страна КАК Страна,
	|	ВременнаяТаблицаГражданство.НаименованиеПолноеСтрана КАК Гражданство,
	|	ВременнаяТаблицаГражданство.ИНН КАК ИННГражданство,
	|	ВременнаяТаблицаРазрешенияПатенты.РазрешениеСерия КАК РазрешениеСерия,
	|	ВременнаяТаблицаРазрешенияПатенты.РазрешениеНомер КАК РазрешениеНомер,
	|	ВременнаяТаблицаРазрешенияПатенты.РазрешениеДатаВыдачи КАК РазрешениеДатаВыдачи,
	|	ВременнаяТаблицаРазрешенияПатенты.РазрешениеДействительноДо КАК РазрешениеДействительноДо,
	|	ВременнаяТаблицаРазрешенияПатенты.РазрешениеТерриторияДействия КАК РазрешениеТерриторияДействия,
	|	ВременнаяТаблицаРазрешенияПатенты.РазрешениеКемВыдано КАК РазрешениеКемВыдано,
	|	ВременнаяТаблицаРазрешенияПатенты.РазрешениеДатаПостановкиНаМиграционныйУчет КАК РазрешениеДатаПостановкиНаМиграционныйУчет,
	|	ВременнаяТаблицаРазрешенияПатенты.РазрешениеКтоПоставилНаУчет КАК РазрешениеКтоПоставилНаУчет,
	|	ВременнаяТаблицаРазрешенияПатенты.МиграционнаяКартаСерия КАК МиграционнаяКартаСерия,
	|	ВременнаяТаблицаРазрешенияПатенты.МиграционнаяКартаНомер КАК МиграционнаяКартаНомер,
	|	ВременнаяТаблицаРазрешенияПатенты.МиграционнаяКартаДатаВыдачи КАК МиграционнаяКартаДатаВыдачи,
	|	ВременнаяТаблицаРазрешенияПатенты.ПатентСерия КАК ПатентСерия,
	|	ВременнаяТаблицаРазрешенияПатенты.ПатентНомер КАК ПатентНомер,
	|	ВременнаяТаблицаРазрешенияПатенты.ПатентДатаВыдачи КАК ПатентДатаВыдачи,
	|	ВременнаяТаблицаРазрешенияПатенты.ПатентСрокС КАК ПатентСрокС,
	|	ВременнаяТаблицаРазрешенияПатенты.ПатентСрокПо КАК ПатентСрокПо,
	|	ВременнаяТаблицаРазрешенияПатенты.ПатентНаименование КАК ПатентНаименование,
	|	ВременнаяТаблицаРазрешенияПатенты.ПатентКемВыдан КАК ПатентКемВыдан,
	|	ПРЕДСТАВЛЕНИЕ(ВременнаяТаблицаУведомления.ГосударственнаяОрганизация) КАК ОрганВласти,
	|	ВременнаяТаблицаУведомления.ДатаУведомления КАК ДатаУведомления,
	|	ВременнаяТаблицаДанныеФизическогоЛица.МестоРождения КАК МестоРождения,
	|	ВременнаяТаблицаДанныеФизическогоЛица.ДатаРождения КАК ДатаРождения,
	|	ВременнаяТаблицаДанныеФизическогоЛица.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской) КАК ПолМужской,
	|	ВременнаяТаблицаДанныеФизическогоЛица.ДатаРегистрации КАК ДатаРегистрации,
	|	ВременнаяТаблицаДокументыФизичесткогоЛица.ВидДокумента КАК ВидДокумента,
	|	ВременнаяТаблицаДокументыФизичесткогоЛица.Серия КАК Серия,
	|	ВременнаяТаблицаДокументыФизичесткогоЛица.Номер КАК Номер,
	|	ВременнаяТаблицаДокументыФизичесткогоЛица.ДатаВыдачи КАК ДатаВыдачи,
	|	ВременнаяТаблицаДокументыФизичесткогоЛица.СрокДействия КАК СрокДействия,
	|	ВременнаяТаблицаДокументыФизичесткогоЛица.КемВыдан КАК КемВыдан,
	|	ВременнаяТаблицаДокументыФизичесткогоЛица.КодПодразделения КАК КодПодразделения,
	|	ВременнаяТаблицаДолжностиСотрудников.Должность КАК Должность,
	|	ЕСТЬNULL(ВременнаяТаблицаАдресФизЛица.ДомашнийАдрес, """") КАК ДомашнийАдрес
	|ИЗ
	|	ДанныеДокументовУвольнение КАК ДанныеДокументовУвольнение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаГражданство КАК ВременнаяТаблицаГражданство
	|		ПО ДанныеДокументовУвольнение.ФизическоеЛицо = ВременнаяТаблицаГражданство.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаРазрешенияПатенты КАК ВременнаяТаблицаРазрешенияПатенты
	|		ПО ДанныеДокументовУвольнение.ФизическоеЛицо = ВременнаяТаблицаРазрешенияПатенты.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУведомления КАК ВременнаяТаблицаУведомления
	|		ПО ДанныеДокументовУвольнение.Ссылка = ВременнаяТаблицаУведомления.ПриказОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДанныеФизическогоЛица КАК ВременнаяТаблицаДанныеФизическогоЛица
	|		ПО ДанныеДокументовУвольнение.ФизическоеЛицо = ВременнаяТаблицаДанныеФизическогоЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыФизичесткогоЛица КАК ВременнаяТаблицаДокументыФизичесткогоЛица
	|		ПО ДанныеДокументовУвольнение.ФизическоеЛицо = ВременнаяТаблицаДокументыФизичесткогоЛица.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДолжностиСотрудников КАК ВременнаяТаблицаДолжностиСотрудников
	|		ПО ДанныеДокументовУвольнение.Сотрудник = ВременнаяТаблицаДолжностиСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаАдресФизЛица КАК ВременнаяТаблицаАдресФизЛица
	|		ПО ДанныеДокументовУвольнение.ФизическоеЛицо = ВременнаяТаблицаАдресФизЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ДанныеДокументовУвольнение.НомерСтроки";

	 
	Возврат Запрос.Выполнить();

КонецФункции 

&НаСервереБезКонтекста
Функция ДанныеИнспектораПоКадрам()

	Если  Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина)
	КонецЕсли;
	
	  Запрос = Новый Запрос;
	  Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	  Запрос.УстановитьПараметр("ВидДокумента",Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
	  Запрос.УстановитьПараметр("Организация",
	  			Справочники.Монолит_ЗначенияСсылокСправочников.ОрганизацияМонолитстрой.ЗначениеСсылки);
	  
	  Запрос.Текст = "ВЫБРАТЬ
	  |	Пользователи.Ссылка КАК Ссылка,
	  |	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
	  |ПОМЕСТИТЬ ВременнаяТаблицаСправочникПользователи
	  |ИЗ
	  |	Справочник.Пользователи КАК Пользователи
	  |ГДЕ
	  |	Пользователи.Ссылка = &Пользователь
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	ФизическоеЛицо
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ФизическиеЛица.Ссылка КАК Ссылка,
	  |	ФизическиеЛица.Фамилия КАК Фамилия,
	  |	ФизическиеЛица.Имя КАК Имя,
	  |	ФизическиеЛица.Отчество КАК Отчество,
	  |	ФизическиеЛица.ФИО КАК ФИО
	  |ПОМЕСТИТЬ ВременнаяТаблицаДанныеФизЛица
	  |ИЗ
	  |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	  |ГДЕ
	  |	ФизическиеЛица.Ссылка В
	  |			(ВЫБРАТЬ
	  |				ВременнаяТаблицаСправочникПользователи.ФизическоеЛицо КАК ФизическоеЛицо
	  |			ИЗ
	  |				ВременнаяТаблицаСправочникПользователи КАК ВременнаяТаблицаСправочникПользователи)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Ссылка
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ ПЕРВЫЕ 1
	  |	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	  |	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка
	  |ПОМЕСТИТЬ ВременнаяТаблицаКонтактныйТелефон
	  |ИЗ
	  |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	  |ГДЕ
	  |	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
	  |			(ВЫБРАТЬ
	  |				ВременнаяТаблицаСправочникПользователи.ФизическоеЛицо КАК ФизическоеЛицо
	  |			ИЗ
	  |				ВременнаяТаблицаСправочникПользователи КАК ВременнаяТаблицаСправочникПользователи)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Ссылка
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ ПЕРВЫЕ 1
	  |	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
	  |	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокумента,
	  |	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	  |	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	  |	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	  |	ДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
	  |	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
	  |	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения,
	  |	ДокументыФизическихЛицСрезПоследних.Представление КАК Представление
	  |ПОМЕСТИТЬ ВременнаяТаблицаДокументыФизическогоЛица
	  |ИЗ
	  |	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	  |			,
	  |			(ВидДокумента, Физлицо) В
	  |				(ВЫБРАТЬ
	  |					&ВидДокумента КАК ВидДокумента,
	  |					ВременнаяТаблицаСправочникПользователи.ФизическоеЛицо КАК ФизическоеЛицо
	  |				ИЗ
	  |					ВременнаяТаблицаСправочникПользователи КАК ВременнаяТаблицаСправочникПользователи)) КАК ДокументыФизическихЛицСрезПоследних
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Физлицо
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ ПЕРВЫЕ 1
	  |	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	  |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	  |ПОМЕСТИТЬ ВременнаяТаблицаКадроваяИстория
	  |ИЗ
	  |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
	  |			,
	  |			(ФизическоеЛицо, ГоловнаяОрганизация) В
	  |				(ВЫБРАТЬ
	  |					ВременнаяТаблицаСправочникПользователи.ФизическоеЛицо КАК ФизическоеЛицо,
	  |					&Организация КАК Организация
	  |				ИЗ
	  |					ВременнаяТаблицаСправочникПользователи КАК ВременнаяТаблицаСправочникПользователи)) КАК КадроваяИсторияСотрудниковСрезПоследних
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	ФизическоеЛицо
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВременнаяТаблицаДанныеФизЛица.Фамилия КАК Фамилия,
	  |	ВременнаяТаблицаДанныеФизЛица.Имя КАК Имя,
	  |	ВременнаяТаблицаДанныеФизЛица.Отчество КАК Отчество,
	  |	ВременнаяТаблицаДанныеФизЛица.ФИО КАК ФИО,
	  |	ВременнаяТаблицаКонтактныйТелефон.НомерТелефона КАК НомерТелефона,
	  |	ПРЕДСТАВЛЕНИЕ(ВременнаяТаблицаДокументыФизическогоЛица.ВидДокумента) КАК ВидДокумента,
	  |	ВременнаяТаблицаДокументыФизическогоЛица.Серия КАК Серия,
	  |	ВременнаяТаблицаДокументыФизическогоЛица.Номер КАК Номер,
	  |	ВременнаяТаблицаДокументыФизическогоЛица.ДатаВыдачи КАК ДатаВыдачи,
	  |	ВременнаяТаблицаДокументыФизическогоЛица.СрокДействия КАК СрокДействия,
	  |	ВременнаяТаблицаДокументыФизическогоЛица.КемВыдан КАК КемВыдан,
	  |	ВременнаяТаблицаДокументыФизическогоЛица.КодПодразделения КАК КодПодразделения,
	  |	ВременнаяТаблицаДокументыФизическогоЛица.Представление КАК ПредставлениеДокумента,
	  |	ПРЕДСТАВЛЕНИЕ(ВременнаяТаблицаКадроваяИстория.Должность) КАК Должность
	  |ИЗ
	  |	ВременнаяТаблицаДанныеФизЛица КАК ВременнаяТаблицаДанныеФизЛица
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКонтактныйТелефон КАК ВременнаяТаблицаКонтактныйТелефон
	  |		ПО ВременнаяТаблицаДанныеФизЛица.Ссылка = ВременнаяТаблицаКонтактныйТелефон.Ссылка
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыФизическогоЛица КАК ВременнаяТаблицаДокументыФизическогоЛица
	  |		ПО ВременнаяТаблицаДанныеФизЛица.Ссылка = ВременнаяТаблицаДокументыФизическогоЛица.Физлицо
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКадроваяИстория КАК ВременнаяТаблицаКадроваяИстория
	  |		ПО ВременнаяТаблицаДанныеФизЛица.Ссылка = ВременнаяТаблицаКадроваяИстория.ФизическоеЛицо";
	  
	  Результат = Запрос.Выполнить();
	  Выборка =  Результат.Выбрать();

	  СтруктураВозврата = Новый Структура;	
	  Для каждого Колонка Из Результат.Колонки Цикл
		  СтруктураВозврата.Вставить(Колонка.Имя)
	  КонецЦикла;

	  Если Выборка.Следующий() Тогда 
		 		  
		  ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
	  Иначе
		  Для каждого КлючИЗначение Из СтруктураВозврата Цикл
		  	    КлючИЗначение.Значение = ""
		  КонецЦикла; 
		  
	  КонецЕсли; 
	  
	  
	  //Данных по доверенности в базе не наю откуда брать
	  СтруктураВозврата.Вставить("ДоверенностьНомер","");
	  СтруктураВозврата.Вставить("ДоверенностьДата","");
	  
	  // № 6 от 18 июня 2018
	  Если СтруктураВозврата.Фамилия = "Гарова" Тогда
		  
		  СтруктураВозврата.ДоверенностьНомер = "6";
		  СтруктураВозврата.ДоверенностьДата = '2018.06.18';
		  
	  КонецЕсли; 
	  
	  Если СтруктураВозврата.Фамилия = "Ященко" Тогда
		  
		  СтруктураВозврата.ДоверенностьНомер = "5";
		  СтруктураВозврата.ДоверенностьДата = '2010.01.17';
		  
	  КонецЕсли; 
	  
	  
	  Возврат СтруктураВозврата;
	  

КонецФункции // ПолучитьДанныеПользователя()

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверкаНаПробелыНули(СтрокаТекста)

	МассивЗнаков = Новый Массив;
	ДлинаСтроки 	= СтрДлина(СтрокаТекста);
	Для Счетчик = 1 По ДлинаСтроки Цикл
		МассивЗнаков.Добавить(Сред(СтрокаТекста,Счетчик,1));
	КонецЦикла; 
	
	МассивЦифр = СтрРазделить("1,2,3,4,5,6,7,8,9",",");
	Для каждого Цифра Из МассивЦифр Цикл
	
		Если Не МассивЗнаков.Найти(Цифра) = Неопределено Тогда
			  Возврат
		КонецЕсли; 
	
	КонецЦикла; 
	
	СтрокаТекста = "";

КонецПроцедуры // ПроверкаНаПробелыНули()

&НаКлиенте
Функция ДобавитьСтраницыВКнигу(КнигаExcel,ПервыйВход,ИмяЛиста)
	
	//ИмяЛиста  - фамилия физ.лица
	Если ПервыйВход Тогда
		КнигаExcel.WorkSheets(1).Name = ИмяОсновногоЛиста(ИмяЛиста);
		КнигаExcel.WorkSheets(2).Name = ИмяДополнительногоЛиста(ИмяЛиста);
		
		ПервыйВход = Ложь
		
	Иначе
		 //Copy(Before, After) Copy два параметра: первый параметр - это "перед", второй - "после"
		 КнигаExcel.WorkSheets(1).Copy(null,КнигаExcel.WorkSheets(КнигаExcel.WorkSheets.Count));
		 КнигаExcel.WorkSheets(КнигаExcel.WorkSheets.Count).Name = ИмяОсновногоЛиста(ИмяЛиста);
		                             
		 КнигаExcel.WorkSheets(2).Copy(null,КнигаExcel.WorkSheets(КнигаExcel.WorkSheets.Count));
		 КнигаExcel.WorkSheets(КнигаExcel.WorkSheets.Count).Name = ИмяДополнительногоЛиста(ИмяЛиста);

	КонецЕсли; 


КонецФункции // ПолучитьСтраницыКниги()

&НаКлиенте
Функция ИмяОсновногоЛиста(ИмяЛиста)

	Возврат ИмяЛиста;

КонецФункции // ИмяОсновногоЛиста()

&НаКлиенте
Функция ИмяДополнительногоЛиста(ИмяЛиста)

	 Возврат СтрШаблон("%1 (доп)",ИмяЛиста);

КонецФункции // ИмяДополнительногоЛиста()

// Дополнительный лист Excel содержит четыре блока по 5 строк
// функция возвращает структуру массивов, где Массив[0] - Булево - флаг использования
//											  Массив[1] - Массив, с номерами строк блока, где последняя строка для обозначения блока основного листа
//
&НаКлиенте
Функция СтруктураДополнительногоЛиста()
	
	СтруктураДопЛиста =  Новый Структура;
	
	//1
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(29);
	МассивСтрок.Добавить(31);
	МассивСтрок.Добавить(33);
	МассивСтрок.Добавить(35);
	МассивСтрок.Добавить(37);
	МассивСтрок.Добавить(39);
	
	Массив = Новый Массив;
	Массив.Добавить(Ложь);
	Массив.Добавить(МассивСтрок);
	
	СтруктураДопЛиста.Вставить("Блок1", Массив);
	
	//2
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(42);
	МассивСтрок.Добавить(44);
	МассивСтрок.Добавить(46);
	МассивСтрок.Добавить(48);
	МассивСтрок.Добавить(52);
	МассивСтрок.Добавить(54);
	
	Массив = Новый Массив;
	Массив.Добавить(Ложь);
	Массив.Добавить(МассивСтрок);
	
	СтруктураДопЛиста.Вставить("Блок2", Массив);

	//3
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(57);
	МассивСтрок.Добавить(59);
	МассивСтрок.Добавить(61);
	МассивСтрок.Добавить(63);
	МассивСтрок.Добавить(65);
	МассивСтрок.Добавить(67);
	
	Массив = Новый Массив;
	Массив.Добавить(Ложь);
	Массив.Добавить(МассивСтрок);
	
	СтруктураДопЛиста.Вставить("Блок3", Массив);

	//4
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(70);
	МассивСтрок.Добавить(72);
	МассивСтрок.Добавить(74);
	МассивСтрок.Добавить(76);
	МассивСтрок.Добавить(78);
	МассивСтрок.Добавить(80);
	
	Массив = Новый Массив;
	Массив.Добавить(Ложь);
	Массив.Добавить(МассивСтрок);
	
	СтруктураДопЛиста.Вставить("Блок4", Массив);
	
	Возврат СтруктураДопЛиста;
	
КонецФункции // СтруктураДополнительногоЛиста()

&НаКлиенте
Функция МассивКолонокВвода(НачальнаяКолонка=1,КонечнаяКолонка=100, Шаг=3)
	Шаг = Шаг-1;
	Массив = Новый Массив;
	Для Счетчик = НачальнаяКолонка По КонечнаяКолонка Цикл
		
		Массив.Добавить(Счетчик);
		 
		 Для i=1 По Шаг Цикл
		 	Счетчик = Счетчик + 1
		КонецЦикла; 
		
	 КонецЦикла;
	 
	 Возврат Массив;
	 
КонецФункции

// Обрезает переданную строку по пробелу справа, выводит данные в доп. лист
//
&НаКлиенте
Процедура ВвестиДанныеВДополнительныйЛист(ТекстВвода,КоличествоЯчеекОЛ,СтруктураПараметров)

	//1. Режем ТекстВвода
	//ПозицияПробела = СтрНайти(ТекстВвода," ",НаправлениеПоиска.СКонца,КоличествоЯчеекОЛ,1);
	ОстатокСтроки = СокрЛП(Сред(ТекстВвода,КоличествоЯчеекОЛ + 1));
	ТекстВвода = СокрЛП(СтрЗаменить(ТекстВвода,ОстатокСтроки,""));
	
	//2. Выводим в доп.лист
	МассивСтрок = Неопределено;
	СтруктураБлоков = СтруктураПараметров.СтруктураБлоковДопЛиста; //структура куда бум размещаться
	Для  i = 1 По 4 Цикл
	    Массив = СтруктураБлоков[СтрШаблон("Блок%1",i)];
		Если Не Массив[0] Тогда
		
			Массив[0] 	= Истина;    		//устанавливаем флаг использования
			МассивСтрок = Массив[1];    //Получаем массив номеров строк вывода
			Прервать;
		
		КонецЕсли;
	КонецЦикла; 
	
	Если МассивСтрок = Неопределено Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Не удалось вывести%1%2%1нет свободных ячеек",Символы.ПС,ОстатокСтроки);
	   	СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли; 

	МассивКолонок1 = МассивКолонокВвода(1,97);
	МассивКолонок2 = МассивКолонокВвода(1,97);
	МассивКолонок3 = МассивКолонокВвода(1,97);
	МассивКолонок4 = МассивКолонокВвода(1,97);
	МассивКолонок5 = МассивКолонокВвода(1,97);

	//1-я строка
	ВывестиОстатокТекстаВСтроку(ОстатокСтроки,МассивСтрок[0],МассивКолонок1,1,СтруктураПараметров.ЛистДополнительнй);
	
	//2-я строка
	ВывестиОстатокТекстаВСтроку(ОстатокСтроки,МассивСтрок[1],МассивКолонок2,МассивКолонок1.Количество()+1,СтруктураПараметров.ЛистДополнительнй);

	//3-я строка
	ВывестиОстатокТекстаВСтроку(ОстатокСтроки,МассивСтрок[2],МассивКолонок3,МассивКолонок2.Количество()+1,СтруктураПараметров.ЛистДополнительнй);
	
	//4-я строка
	ВывестиОстатокТекстаВСтроку(ОстатокСтроки,МассивСтрок[3],МассивКолонок4,МассивКолонок3.Количество()+1,СтруктураПараметров.ЛистДополнительнй);
	
	//5-я строка
	ВывестиОстатокТекстаВСтроку(ОстатокСтроки,МассивСтрок[4],МассивКолонок5,МассивКолонок4.Количество()+1,СтруктураПараметров.ЛистДополнительнй);
	
	//Последняя сторка блока
	СтруктураПараметров.ЛистДополнительнй.Cells(МассивСтрок[5], 1).Value = СтруктураПараметров.ИмяОбласти;
	СтруктураПараметров.ЛистДополнительнй.Cells(МассивСтрок[5], 27).Value = СтруктураПараметров.Описание;
	
	
КонецПроцедуры // ВвестиДанныеВДополнительныйЛист()

// <Описание процедуры>
&НаКлиенте
Процедура ВывестиОстатокТекстаВСтроку(ТекстВывода,НомерСтроки,МассивКолонок,ПозицияСреза=1,Лист)

	ТекстВывода = Сред(СокрЛП(ТекстВывода),ПозицияСреза);
	
	ДлинаСтроки = СтрДлина(ТекстВывода);
	Если ДлинаСтроки = 0 Тогда
		 Возврат
	КонецЕсли; 
	
	МаксимальныйИндекс = Мин(ДлинаСтроки - 1, МассивКолонок.ВГраница()); //где 97 № последней ячейки
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		Лист.Cells(НомерСтроки, МассивКолонок[Индекс]).Value = Сред(ТекстВывода, Индекс +1, 1)
	КонецЦикла; 


КонецПроцедуры // ВывестиОстатокТекстаВСтроку()

&НаКлиенте
Функция ПреобразоватьДатуВСтруктуруВвода(ЗначениеДата)
	
	Если ЗначениеДата = '00010101' Тогда
		Возврат ""
	КонецЕсли; 
	
	Если Не ТипЗнч(ЗначениеДата) = Тип("Дата") Тогда
		Возврат ""
	КонецЕсли; 
	
	СтруктураДаты = Новый Структура;
	СтруктураДаты.Вставить("День",	Формат(День(ЗначениеДата),"ЧЦ=2; ЧГ=0; ЧВН="));
	СтруктураДаты.Вставить("Месяц", Формат(Месяц(ЗначениеДата),"ЧЦ=2; ЧГ=0; ЧВН="));
	СтруктураДаты.Вставить("Год",	Формат(Год(ЗначениеДата),"ЧЦ=4; ЧГ=0; ЧВН="));
	
	Возврат СтруктураДаты;
	
КонецФункции // ПреобразоватьДату()

&НаКлиенте
Функция МесяцПрописью(ЗначениеДата)
	
	Если Не ТипЗнч(ЗначениеДата) = Тип("Дата") Тогда
		Возврат ""
	КонецЕсли; 
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(1,"января");
	Соответствие.Вставить(2,"февраля");
	Соответствие.Вставить(3,"марта");
	Соответствие.Вставить(4,"апреля");
	Соответствие.Вставить(5,"мая");
	Соответствие.Вставить(6,"июня");
	Соответствие.Вставить(7,"июля");
	Соответствие.Вставить(8,"августа");
	Соответствие.Вставить(9,"сентября");
	Соответствие.Вставить(10,"октября");
	Соответствие.Вставить(11,"ноября");
	Соответствие.Вставить(12,"декабря");

	Возврат Соответствие[Месяц(ЗначениеДата)];	

КонецФункции // МесяцПрописью()


#КонецОбласти 


