#Область СведенияОВнешнейОбработке
	
// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации 		= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.3.362");
	ПараметрыРегистрации.Вид 	= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Версия 			= "2.4.13";
	ПараметрыРегистрации.БезопасныйРежим 	= Истина;
	ПараметрыРегистрации.Наименование 		= "Уведомление о расторжении трудового договора";
	ПараметрыРегистрации.Информация 		= "формирование документа WORD";
	
	МассивНазначений = Новый Массив();
	МассивНазначений.Добавить("Документ.Увольнение");										
	МассивНазначений.Добавить("Документ.УвольнениеСписком");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
  
  
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Уведомление о расторжении трудового договора прил. № 8'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_УведомлениеОРасторжении";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Дополнительный лист прил. № 1'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_ДополнительныйЛист";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();

	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Справка прил. № 3'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_СправкаПриУвольнении";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Уведомление  прил. № 8 + Справка прил. № 3 + Доп. лист прил. № 1'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_УведомлениеПакет";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции


#КонецОбласти 
