#Область СведенияОВнешнейОбработке
	
// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации 		= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.3.362");
	ПараметрыРегистрации.Вид 	= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Версия 			= "2.4.13";
	ПараметрыРегистрации.БезопасныйРежим 	= Истина;
	ПараметрыРегистрации.Наименование 		= "Уведомление заключении трудового договора";
	ПараметрыРегистрации.Информация 		= "формирование WORD документа по шаблону МВД";
	
	МассивНазначений = Новый Массив();
	МассивНазначений.Добавить("Документ.ПриемНаРаботу");										
	МассивНазначений.Добавить("Документ.ПриемНаРаботуСписком");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
  
  
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Уведомление о заключении трудового договора прил. № 7'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_УведомлениеЗаключенииТрудовогоДоговора";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Дополнительный лист прил. № 1'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_ДополнительныйЛист";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();

	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Справка прил. № 3'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_СправкаПриТрудовогоДоговора";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Уведомление  прил. № 7 + Справка прил. № 3 + Доп. лист прил. № 1'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_УведомлениеЗаключенииТрудовогоДоговораПакет";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	
	Возврат ПараметрыРегистрации;
	
КонецФункции


#КонецОбласти 
