#Область СведенияОВнешнейОбработке
	
// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации 		= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.1.355");
	ПараметрыРегистрации.Вид 	= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Версия 			= "2.4.6";
	ПараметрыРегистрации.БезопасныйРежим 	= Истина;
	ПараметрыРегистрации.Наименование 		= "Уведомление об увольнении иностранца прил.14";
	ПараметрыРегистрации.Информация 		= "формирование документа WORD";
	
	МассивНазначений = Новый Массив();
	МассивНазначений.Добавить("Документ.Увольнение");										
	МассивНазначений.Добавить("Документ.УвольнениеСписком");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
  
  
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Уведомление об увольнении иностранца прил.14'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_УведомлениеОбУвольнении_14";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	
		
	Возврат ПараметрыРегистрации;
	
КонецФункции


#КонецОбласти 
