#Область СведенияОВнешнейОбработке

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации 		= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.2.455");
	ПараметрыРегистрации.Вид 	= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Версия 			= "2.4.12";
	ПараметрыРегистрации.БезопасныйРежим 	= Истина;
	ПараметрыРегистрации.Наименование 		= "Уведомление о привлечении прил.13 (XLS)";
	ПараметрыРегистрации.Информация 		= "формирование документа XLS";
	
	МассивНазначений = Новый Массив();
	МассивНазначений.Добавить("Документ.ПриемНаРаботу");										
	МассивНазначений.Добавить("Документ.ПриемНаРаботуСписком");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
  
  
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Уведомление о привлечении прил.13 (XLS)'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_УведомлениеОПривлечении_13_XLS";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	
		
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти 
